In [1]:
%%sh
ls Exercise01/

airlines.csv
airports.csv
flights.csv
planes.csv
weather.csv

In [9]:
import pandas as pd
import numpy as np

import sqlite3

names = ('airlines', 'airports', 'flights', 'planes', 'weather')

for name in names:
    print(name)
    print(
        pd.read_csv(f"Exercise01/{name}.csv", comment='#').head()
    )
    print('-'*10)

airlines
  carrier                    name
0      9E       Endeavor Air Inc.
1      AA  American Airlines Inc.
2      AS    Alaska Airlines Inc.
3      B6         JetBlue Airways
4      DL    Delta Air Lines Inc.
----------
airports
   faa                           name        lat        lon   alt  tz dst  \
0  04G              Lansdowne Airport  41.130472 -80.619583  1044  -5   A
1  06A  Moton Field Municipal Airport  32.460572 -85.680028   264  -6   A
2  06C            Schaumburg Regional  41.989341 -88.101243   801  -6   A
3  06N                Randall Airport  41.431912 -74.391561   523  -5   A
4  09J          Jekyll Island Airport  31.074472 -81.427778    11  -5   A

              tzone
0  America/New_York
1   America/Chicago
2   America/Chicago
3  America/New_York
4  America/New_York
----------
flights
   year  month  day  dep_time  sched_dep_time  dep_delay  arr_time  \
0  2013      1    1     517.0             515        2.0     830.0
1  2013      1    1     533.0             529        4.0     850.0
2  2013      1    1     542.0             540        2.0     923.0
3  2013      1    1     544.0             545       -1.0    1004.0
4  2013      1    1     554.0             600       -6.0     812.0

   sched_arr_time  arr_delay carrier  flight tailnum origin dest  air_time  \
0             819       11.0      UA    1545  N14228    EWR  IAH     227.0
1             830       20.0      UA    1714  N24211    LGA  IAH     227.0
2             850       33.0      AA    1141  N619AA    JFK  MIA     160.0
3            1022      -18.0      B6     725  N804JB    JFK  BQN     183.0
4             837      -25.0      DL     461  N668DN    LGA  ATL     116.0

   distance  hour  minute            time_hour
0      1400     5      15  2013-01-01 05:00:00
1      1416     5      29  2013-01-01 05:00:00
2      1089     5      40  2013-01-01 05:00:00
3      1576     5      45  2013-01-01 05:00:00
4       762     6       0  2013-01-01 06:00:00
----------
planes
  tailnum    year                     type      manufacturer      model  \
0  N10156  2004.0  Fixed wing multi engine           EMBRAER  EMB-145XR
1  N102UW  1998.0  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214
2  N103US  1999.0  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214
3  N104UW  1999.0  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214
4  N10575  2002.0  Fixed wing multi engine           EMBRAER  EMB-145LR

   engines  seats  speed     engine
0        2     55    NaN  Turbo-fan
1        2    182    NaN  Turbo-fan
2        2    182    NaN  Turbo-fan
3        2    182    NaN  Turbo-fan
4        2     55    NaN  Turbo-fan
----------
weather
  origin  year  month  day  hour   temp   dewp  humid  wind_dir  wind_speed  \
0    EWR  2013      1    1     1  39.02  26.06  59.37     270.0    10.35702
1    EWR  2013      1    1     2  39.02  26.96  61.63     250.0     8.05546
2    EWR  2013      1    1     3  39.02  28.04  64.43     240.0    11.50780
3    EWR  2013      1    1     4  39.92  28.04  62.21     250.0    12.65858
4    EWR  2013      1    1     5  39.02  28.04  64.43     260.0    12.65858

   wind_gust  precip  pressure  visib             time_hour
0        NaN     0.0    1012.0   10.0  2013-01-01T06:00:00Z
1        NaN     0.0    1012.3   10.0  2013-01-01T07:00:00Z
2        NaN     0.0    1012.5   10.0  2013-01-01T08:00:00Z
3        NaN     0.0    1012.2   10.0  2013-01-01T09:00:00Z
4        NaN     0.0    1011.9   10.0  2013-01-01T10:00:00Z
----------

In [3]:
conn = sqlite3.connect('pandas_exercise_01')

dfs = {}

for name in names:
    df = pd.read_csv(f"Exercise01/{name}.csv", comment='#')
    dfs[name] = df
    df.to_sql(name, con=conn, if_exists='replace')

In [4]:
# SELECT engine FROM planes

In [6]:
planes_df = dfs['planes']
planes_df[['engine']]

         engine
0     Turbo-fan
1     Turbo-fan
2     Turbo-fan
3     Turbo-fan
4     Turbo-fan
...         ...
3317  Turbo-fan
3318  Turbo-fan
3319  Turbo-fan
3320  Turbo-jet
3321  Turbo-jet

[3322 rows x 1 columns]

In [1]:
# SELECT DISTINCT engine FROM planes

In [2]:
# SELECT DISTINCT type, manufacturer FROM planes

In [3]:
# SELECT COUNT(*), engine FROM planes GROUP BY engine

In [4]:
# SELECT COUNT(*), engine, type FROM planes
# GROUP BY engine, type

In [5]:
# SELECT MIN(year), AVG(year), MAX(year), engine, manufacturer FROM planes GROUP BY engine,
# manufacturer

In [6]:
# SELECT * FROM planes WHERE speed IS NOT NULL

In [13]:
# SELECT tailnum FROM planes WHERE seats BETWEEN 150 AND 190 AND year >= 2012
planes_df['seats'].between(150, 190)

0       False
1        True
2        True
3        True
4       False
        ...
3317    False
3318    False
3319    False
3320    False
3321    False
Name: seats, Length: 3322, dtype: bool

In [8]:
# SELECT * FROM planes WHERE manufacturer IN ("BOEING", "AIRBUS", "EMBRAER")
# AND seats>390

In [9]:
# SELECT DISTINCT year, seats FROM planes WHERE year >= 2012
# ORDER BY year ASC, seats DESC

In [10]:
#  SELECT manufacturer, COUNT(*) FROM planes WHERE seats > 200
# GROUP BY manufacturer

In [11]:
# SELECT manufacturer, COUNT(*) FROM planes
# GROUP BY manufacturer HAVING COUNT(*) > 10

In [7]:
planes_df = dfs['planes']

planes_df = planes_df.groupby('manufacturer')[['tailnum']].count()

In [8]:
planes_df[planes_df['tailnum'] > 10]

                               tailnum
manufacturer
AIRBUS                             336
AIRBUS INDUSTRIE                   400
BOEING                            1630
BOMBARDIER INC                     368
EMBRAER                            299
MCDONNELL DOUGLAS                  120
MCDONNELL DOUGLAS AIRCRAFT CO      103
MCDONNELL DOUGLAS CORPORATION       14